[
  {
    "title": {
      "fi": "EDELLISEN VUODEN TILANNEKUVAN LÄPIKÄYNTI",
      "se": "ÖVERSIKT ÖVER FÖRRA ÅRETS LÄGESRAPPORT",
      "en": "REVIEW OF PREVIOUS YEARS' STATUS REPORT"
    },
    "parts": [
      {
        "id": "review_of_last_years_situation_report",
        "index": 0,
        "type": "ENTITY",
        "shortLabel": {
          "fi": "Edellinen läpikäynti",
          "se": "Föregående översikt",
          "en": "Review of last year"
        },
        "label": {
          "fi": "EDELLISEN VUODEN TILANNEKUVAN LÄPIKÄYNTI",
          "se": "ÖVERSIKT ÖVER FÖRRA ÅRETS LÄGESRAPPORT",
          "en": "REVIEW OF PREVIOUS YEARS' STATUS REPORT"
        },
        "description": {
          "fi": "Näkyvätkö toimenpidelistan asiat tiedekunnan toimenpidesuunnitelmassa ja / tai henkilöstösuunnitelmassa? Mitkä asiat ovat toteutuneet? Mitä muutoksia suunnittelussa on tarve tehdä tällä kertaa?",
          "se": "Är punkterna på åtgärdslistan reflekterade i fakultetens handlingsplan och/eller personalplan? Vilka åtgärder har genomförts? Vilka ändringar i planeringen behöver göras denna gång?",
          "en": "Are the items on the list of measures visible in the implementation and/or HR plans? Which items have been achieved? Which have been put back? What will be done differently this time around?"
        },
        "required": true,
        "extrainfo": {
          "fi": "",
          "se": "",
          "en": ""
        }
      }
    ]
  },
  {
    "title": {
      "fi": "KOULUTUSOHJELMAN YLEISTILANNE",
      "se": "DET ALLMÄNNA LÄGET INOM UTBILDNINGSPROGRAMMET",
      "en": "OVERALL STATUS OF THE DEGREE PROGRAMME"
    },
    "link_title": {
      "fi": "Tuotetut tiedot",
      "se": "Framtagna uppgifter",
      "en": "Information provided"
    },
    "link_url": "https://oodikone.cs.helsinki.fi/",
    "parts": [
      {
        "id": "student_admissions",
        "index": 1,
        "type": "ENTITY",
        "shortLabel": {
          "fi": "Opiskelijavalinta",
          "se": "Studentantagning",
          "en": "Student admissions"
        },
        "label": {
          "fi": "OPISKELIJAVALINTA",
          "se": "STUDENTREKRYTERING OCH STUDENTANTAGNING",
          "en": "STUDENT ADMISSIONS"
        },
        "description": {
          "fi": "Onko ohjelman aloituspaikkamäärä sopiva? Onko hakijoita riittävästi ja ovatko he ohjelmaan sopivia? Miten opiskelijavalinta toimii?  Mikä on kansainvälisten opiskelijoiden osuus opiskelijamäärästä? Paljonko koulutusohjelmassa jatkaa HY:ssä alemman tutkinnon suorittaneita - entä  paljonko opiskelijoita rekrytoidaan muista kotimaisista korkeakouluista? Miten tohtoriohjelman opiskelijavalinta (tutkinnonsuoritusoikeus) ja palkkapaikkojen jako toimivat?",
          "se": "Hurdant söktryck har programmet? Finns det tillräckligt många sökande? Är antalet nybörjarplatser lämpligt? Är de sökande lämpliga för programmet? Är programmets marknadsföring lyckad? Hur fungerar studentantagningen? Hur många internationella studenter är det meningen att rekrytera till programmet? Vilken är deras andel av det totala antalet nya studenter?",
          "en": "Is the number of places available to new students in the programme suitable? Is the number of applicants sufficient and are the applicants suitable for the programme? How well do the admissions procedures function? What is the ratio of international students to the total number of students? How many students who have completed a lower-level degree at the University of Helsinki continue in the programme, and how many students are recruited from other Finnish institutions of higher education? In the case of a doctoral programme, how well do student admissions (procedure for granting the right to complete a degree) and the allocation of salaried doctoral student positions function?"
        },
        "required": true,
        "extrainfo": {
          "fi": "",
          "se": "",
          "en": ""
        }
      },
      {
        "id": "language_environment",
        "index": 2,
        "type": "ENTITY",
        "shortLabel": {
          "fi": "Kieliympäristö",
          "se": "Språkmiljö",
          "en": "Language environment"
        },
        "label": {
          "fi": "KIELIYMPÄRISTÖ",
          "se": "SPRÅKMILJÖ",
          "en": "LANGUAGE ENVIRONMENT"
        },
        "description": {
          "fi": "Miten opetus, ohjaus ja opiskelijapalvelut ovat toteutuneet eri kielillä (suomi, ruotsi, englanti)? Onko englanninkielisessä ja monikielisessä koulutusohjelmassa onnistuttu luomaan kaikille sopiva kieliympäristö? Toimiiko monikielinen koulutusohjelma eri kielten (suomi, ruotsi, englanti) näkökulmasta? Onko kansainvälisillä opiskelijoilla mahdollisuus opiskella kotimaisia kieliä (suomi, ruotsi)?",
          "se": "Har det uppstått en engelskspråkig studiemiljö i utbildningsprogrammet? Har man lyckats med att erbjuda undervisning, handledning och studentservice på engelska? Hur bedömer ni att utbildningsprogrammet profilerar sig på den internationella utbildningsmarknaden?",
          "en": "How successfully have teaching, guidance, supervision and student services been provided in various languages (Finnish, Swedish and English)? In the case of an English-language or multilingual degree programme, has the programme created a language environment that is suitable for everyone? In the case of a multilingual degree programme, does the programme function well from the perspective of the various languages (Finnish, Swedish and English)? Do international students have the opportunity to study the national languages of Finland (Finnish and Swedish)?"
        },
        "required": true,
        "extrainfo": {
          "fi": "",
          "se": "",
          "en": ""
        }
      },
      {
        "id": "programme_identity",
        "index": 3,
        "type": "ENTITY",
        "shortLabel": {
          "fi": "Ohjelman identiteetti",
          "se": "Programmets profil",
          "en": "Programme identity"
        },
        "label": {
          "fi": "KOULUTUSOHJELMAN PROFIILI JA EROTTUVUUS YLIOPISTON SISÄLLÄ, KANSALLISESTI JA KANSAINVÄLISESTI",
          "se": "UTBILDNINGSPROGRAMMETS PROFIL OCH SÄRDRAG",
          "en": "PROFILE AND DISTINCTIVE FEATURES OF THE DEGREE PROGRAMME WITHIN THE UNIVERSITY, IN FINLAND AND ABROAD"
        },
        "description": {
          "fi": "Onko koulutusohjelmalla selkeä profiili ja identiteetti, jonka sekä ohjelmassa opettavat ja ohjaavat että opiskelijat/tohtorikoulutettavat tunnistavat? Miten ohjelman profiili erottuu muista saman koulutusalan ja koulutustason koulutusohjelmista?",
          "se": "Har utbildningen en tydlig profil och identitet som erkänns av lärarna, handledare samt doktorander? Hur skiljer sig programprofilen från andra utbildningsprogram inom samma område och nivå?",
          "en": "Does the degree programme have a clear profile and identity recognised by its teachers, those providing guidance and supervision as well as (doctoral) students? How does the programme profile stand out from other degree programmes in the same field and of the same level?"
        },
        "required": true,
        "extrainfo": {
          "fi": "",
          "se": "",
          "en": ""
        }
      },
      {
        "id": "employability",
        "index": 4,
        "type": "ENTITY",
        "shortLabel": {
          "fi": "Työelämärelevanssi",
          "se": "Arbetslivsrelevans",
          "en": "Employability"
        },
        "label": {
          "fi": "TYÖELÄMÄRELEVANSSI",
          "se": "ARBETSLIVSRELEVANS",
          "en": "EMPLOYABILITY"
        },
        "description": {
          "fi": "Miten valtakunnallisen uraseurannan tuloksia hyödynnetään ohjelmassa?  Millä muilla tavoilla johtoryhmä seuraa alan työllisyyttä ja koulutusohjelman tuottaman osaamisen kysyntää (kotimaisilla ja kansainvälisillä) työmarkkinoilla? Miten ohjelmassa tuetaan opiskelijoiden urasuunnittelua ja työelämäyhteyksien rakentumista? Miten ohjelmassa huomioidaan kv-opiskelijoiden erityistarpeet ja -haasteet työllistymisessä?",
          "se": "Hur följer utbildningsprogrammet sysselsättningsläget inom branschen och den inhemska och internationella efterfrågan på den kompetens som utbildningsprogrammet ger? Vilken är utbildningsprogrammets bedömning av läget? Hur stöder programmet studenternas karriärplanering och utveckling av arbetslivskontakter?",
          "en": "How are the results of national career tracking used in the programme? In what other ways does the programme steering group monitor relevant employment figures and the demand for the expertise it provides in the (Finnish and international) job market? How does the programme support students in career planning and the establishment of employer connections? How does the programme take the special employment needs and challenges of international students into account?"
        },
        "required": true,
        "extrainfo": {
          "fi": "",
          "se": "",
          "en": ""
        }
      },
      {
        "id": "learning_outcomes",
        "index": 5,
        "type": "ENTITY",
        "shortLabel": {
          "fi": "Osaamistavoitteet",
          "se": "Kunskapsmål",
          "en": "Learning outcomes"
        },
        "label": {
          "fi": "KOULUTUSOHJELMAN OSAAMISTAVOITTEET",
          "se": "UTBILDNINGSPROGRAMMETS KUNSKAPSMÅL",
          "en": "LEARNING OUTCOMES"
        },
        "description": {
          "fi": "Ovatko koulutusohjelmalle asetetut osaamistavoitteet selkeät ja realistiset? Miten koulutusohjelman osaamistavoitteita pitäisi kehittää?",
          "se": "Är utbildningsprogrammets kunskapsmål realistiska? Når studenterna målen? Är kunskapsmålen lämpligt preciserade? Hur borde kunskapsmålen utvecklas?",
          "en": "Are the learning outcomes set for the degree programme clear and realistic? How should the learning outcomes be developed?"
        },
        "required": true,
        "extrainfo": {
          "fi": "",
          "se": "",
          "en": ""
        }
      },
      {
        "id": "curriculum",
        "index": 6,
        "type": "ENTITY",
        "shortLabel": {
          "fi": "Opetussuunnitelma",
          "se": "Undervisningsplan",
          "en": "Curriculum"
        },
        "label": {
          "fi": "OPETUSSUUNNITELMAN TOIMIVUUS JA KEHITTÄMINEN",
          "se": "UNDERVISNINGSPLANENS ÄNDAMÅLSENLIGHET OCH UTVECKLINGSBEHOV",
          "en": "FUNCTIONALITY AND DEVELOPMENT OF THE CURRICULUM"
        },
        "description": {
          "fi": "Miten ohjelman opetussuunnitelmassa ja opetusohjelmassa varmistetaan, että kaikki opiskelijat voivat suorittaa ja suorittavat koulutusohjelman tavoiteajassa? Onko opetustarjonta riittävää ja tarkoituksenmukaista? Onko koulutusohjelmassa riittävästi opetusta eri kielillä (suomi, ruotsi, englanti)? Miten ruotsinkielinen koulutus toimii erityisesti, jos koulutusohjelmassa on ruotsinkielinen hakukohde?",
          "se": "Är undervisningsutbudet tillräckligt och ändamålsenligt? På vilket sätt säkerställer man i undervisningsplanen och undervisningsprogrammet att studenterna kan slutföra och slutför utbildningsprogrammet inom den målsatta tiden?",
          "en": "How do the curriculum and the teaching programme ensure that all students can and do complete the degree programme within the target duration? Does the programme offer sufficient and appropriate teaching? Does the programme offer sufficient teaching in various languages (Finnish, Swedish and English)? How does Swedish-language education function, particularly if the programme offers applicants a Swedish-language option?"
        },
        "required": true,
        "extrainfo": {
          "fi": "",
          "se": "",
          "en": ""
        }
      },
      {
        "id": "guidance",
        "index": 7,
        "type": "ENTITY",
        "shortLabel": {
          "fi": "Opintojen ohjaus",
          "se": "Studiehandledningen",
          "en": "Student guidance"
        },
        "label": {
          "fi": "OPINTOJEN OHJAUKSEN TOIMIVUUS",
          "se": "STUDIEHANDLEDNINGENS ÄNDAMÅLSENLIGHET",
          "en": "STUDENT GUIDANCE AND SUPERVISION"
        },
        "description": {
          "fi": "Miten HOPS- ja muu opintojen ohjaus on toteutettu ja miten se on toiminut? Miten opintojen ohjausta pitäisi kehittää koulutusohjelmassa? Miten tutkielmien ja väitöskirjojen ohjaus toimii?",
          "se": "Hur har studiehandledningen fungerat? Hur borde utbildningsprogrammets studiehandledning utvecklas? Hur fungerar handledningen av examensarbeten (kandidat-, magister- och doktorsavhandlingar)?",
          "en": "How does the programme offer guidance and supervision associated with personal study plans and other studies, and how have such guidance and supervision functioned? How should the guidance and supervision be developed? How does the supervision of theses and dissertations function?"
        },
        "required": true,
        "extrainfo": {
          "fi": "",
          "se": "",
          "en": ""
        }
      },
      {
        "id": "student_feedback",
        "index": 8,
        "type": "ENTITY",
        "shortLabel": {
          "fi": "Opiskelijapalaute",
          "se": "Respons",
          "en": "Student feedback"
        },
        "label": {
          "fi": "OPISKELIJAPALAUTTEEN HYÖDYNTÄMINEN",
          "se": "ANVÄNDNING AV RESPONS",
          "en": "USE OF STUDENT FEEDBACK"
        },
        "description": {
          "fi": "Miten eri palautteita ohjelmassa hyödynnetään ja miten? Miten eri tavoin kerätyt palautteet on käsitelty koulutusohjelmassa? Ketkä ovat osallistuneet palautteiden käsittelyyn? Mitä muutoksia palautteista on seurannut?",
          "se": "Hur fungerar användningen av respons? Hur har responsen som insamlats på olika sätt behandlats vid utbildningsprogrammet? Av vem har responsen behandlats? Vilka ändringar har responsen gett upphov till?",
          "en": "What types of feedback does the programme use and how? How has the feedback collected been processed in the degree programme? Who has participated in processing the feedback? What changes have been made based on the feedback?"
        },
        "required": true,
        "extrainfo": {
          "fi": "",
          "se": "",
          "en": ""
        }
      },
      {
        "id": "meta1",
        "type": "TITLE",
        "label": {
          "fi": "KOULUTUSOHJELMAN YLEISTILANNE",
          "se": "DET ALLMÄNNA LÄGET INOM UTBILDNINGSPROGRAMMET",
          "en": "OVERALL STATUS OF THE DEGREE PROGRAMME"
        }
      },
      {
        "id": "overall_status_information_used",
        "index": "I",
        "type": "TEXTAREA",
        "label": {
          "fi": "Mitä muita tietoja ja tietolähteitä käytitte koulutusohjelman yleistilanteesta keskusteltaessa?",
          "se": "Vilka andra uppgifter och uppgiftskällor använde ni?",
          "en": "What other information did you use?"
        },
        "required": false,
        "no_color": true,
        "extrainfo": {
          "fi": "",
          "se": "",
          "en": ""
        }
      },
      {
        "id": "overall_status_information_needed",
        "index": "I",
        "type": "TEXTAREA",
        "label": {
          "fi": "Mitä tietoja jäitte kaipaamaan?",
          "se": "Vilka uppgifter skulle ni ytterligare ha behövt?",
          "en": "What information would you have needed?"
        },
        "required": false,
        "no_color": true,
        "extrainfo": {
          "fi": "",
          "se": "",
          "en": ""
        }
      }
    ]
  },
  {
    "title": {
      "fi": "HYVINVOINTI",
      "se": "VÄLBEFINNANDE",
      "en": "WELLBEING"
    },
    "parts": [
      {
        "id": "community_wellbeing",
        "index": 9,
        "type": "ENTITY",
        "shortLabel": {
          "fi": "Yhteisön hyvinvointi",
          "se": "Välbefinnandet",
          "en": "Community wellbeing"
        },
        "label": {
          "fi": "YHTEISÖN HYVINVOINTI",
          "se": "VÄLBEFINNANDET I UTBILDNINGSPROGRAMMET",
          "en": "COMMUNITY WELLBEING"
        },
        "description": {
          "fi": "Miten opettajien ja opiskelijoiden hyvinvointia seurataan? Onko opetuksen ja opintojen kuormittavuutta arvioitu? Mitä toimenpiteitä on tehty?",
          "se": "Hur följs lärarnas och studenternas välbefinnande? Har det gjorts en bedömning av hur betungande undervisningen och studierna är? Vilka åtgärder har vidtagits?",
          "en": "How is the wellbeing of teachers and students monitored? Has the workload of teachers and students been assessed? What measures have been taken?"
        },
        "required": true,
        "extrainfo": {
          "fi": "",
          "se": "",
          "en": ""
        }
      },
      {
        "id": "teacher_skills",
        "index": 10,
        "type": "ENTITY",
        "shortLabel": {
          "fi": "Opettajien osaaminen",
          "se": "Lärarnas kompetens",
          "en": "Teacher skills"
        },
        "label": {
          "fi": "OPETTAJIEN OSAAMINEN JA OSAAMISEN KEHITTÄMINEN",
          "se": "LÄRARNAS OCH HANDLEDARNAS KOMPETENS OCH KOMPETENSUTVECKLING",
          "en": "TEACHER SKILLS AND THEIR DEVELOPMENT"
        },
        "description": {
          "fi": "Ovatko koulutusohjelman opettajien osaaminen ja vahvuudet tiedossa ja käytössä? Kannustetaanko opettajia kehittämään opetustaitojaan? Tarvitsevatko koulutusohjelman opettajat kieli- ja monikulttuurisen pedagogiikan tai digitaalisten taitojen tukea?",
          "se": "Utnyttjas lärarnas kompetens och styrkor till fullo vid utbildningsprogrammet? Uppmuntras lärarna till att utveckla sina undervisningsfärdigheter? Är programmets lärare i behov av språkligt stöd och stöd för mångkulturell pedagogik?",
          "en": "Are the skills and strengths of the degree programme teachers known and used? Are the teachers encouraged to enhance their teaching skills? Do the teachers need support for multilingual and multicultural education or digital skills?"
        },
        "required": true,
        "extrainfo": {
          "fi": "",
          "se": "",
          "en": ""
        }
      },
      {
        "id": "management",
        "index": 11,
        "type": "ENTITY",
        "shortLabel": {
          "fi": "Johtaminen",
          "se": "Ledarskap",
          "en": "Management"
        },
        "label": {
          "fi": "JOHTAMINEN JA VIESTINTÄ",
          "se": "LEDARSKAP OCH KOMMUNIKATION",
          "en": "MANAGEMENT AND COMMUNICATION"
        },
        "description": {
          "fi": "Miten johtoryhmän toiminta on onnistunut? Mitä haasteita johtoryhmän toiminnassa ja johtamisessa on havaittu? Miten koulutusohjelman sisäinen tiedonkulku/viestintä/vuorovaikutus opettajien, opiskelijoiden ja johdon (johtaja ja johtoryhmä) kesken sujuu? Mitä kehittämistoimenpiteitä on tehty?",
          "se": "Hur har ledningsgruppens verksamhet fungerat? Vilka utmaningar har framkommit i fråga om ledningsgruppens verksamhet och ledningen av programmet? Hur fungerar den interna informationsgången mellan utbildningsprogrammets lärare, studenter och ledning (ledaren och ledningsgruppen)? Informationsgången till fakulteten? Vilka utvecklingsåtgärder har vidtagits?",
          "en": "Has the steering group worked successfully? What challenges have been identified in the steering group’s work and management? How does internal information distribution/communication/interaction function between the programme teachers, students and leadership (director and steering group)? What development measures have been taken?"
        },
        "required": true,
        "extrainfo": {
          "fi": "",
          "se": "",
          "en": ""
        }
      },
      {
        "id": "meta2",
        "type": "TITLE",
        "label": {
          "fi": "HYVINVOINTI",
          "se": "VÄLBEFINNANDE",
          "en": "WELLBEING"
        }
      },
      {
        "id": "wellbeing_information_used",
        "index": "II",
        "type": "TEXTAREA",
        "label": {
          "fi": "Mitä tietoja ja tietolähteitä käytitte?",
          "se": "Vilka uppgifter skulle ni ytterligare ha behövt?",
          "en": "What other information and sources of information did you use?"
        },
        "required": false,
        "no_color": true,
        "extrainfo": {
          "fi": "",
          "se": "",
          "en": ""
        }
      },
      {
        "id": "wellbeing_information_needed",
        "index": "II",
        "type": "TEXTAREA",
        "label": {
          "fi": "Mitä tietoja jäitte kaipaamaan?",
          "se": "Vilka uppgifter skulle ni ha behövt?",
          "en": "What information would you have needed?"
        },
        "required": false,
        "no_color": true,
        "extrainfo": {
          "fi": "",
          "se": "",
          "en": ""
        }
      }
    ]
  },
  {
    "title": {
      "fi": "HENKILÖSTÖ- JA MUIDEN RESURSSIEN RIITTÄVYYS JA TOIMIVUUS",
      "se": "PERSONALRESURSERNAS OCH DE ANDRA RESURSERNAS TILLRÄCKLIGHET OCH ÄNDAMÅLSENLIGHET",
      "en": "SUFFICIENT AND APPROPRIATE HUMAN AND OTHER RESOURCES"
    },
    "parts": [
      {
        "id": "teaching_resources",
        "index": 12,
        "type": "ENTITY",
        "shortLabel": {
          "fi": "Opetusresurssit",
          "se": "Undervisningsresurser",
          "en": "Teaching resources"
        },
        "label": {
          "fi": "OPETUSRESURSSIT",
          "se": "UNDERVISNINGSRESURSER",
          "en": "TEACHING RESOURCES"
        },
        "description": {
          "fi": "Miten koulutusohjelman opetus ja ohjausresurssit ovat riittäneet? Miten koulutusohjelman ja tiedekunnan/ osaston neuvottelut opettajien työpanoksista ovat onnistuneet? Onko koulutusohjelman opetusresursseissa tapahtunut merkittäviä muutoksia, jotka ovat vaikuttaneet ohjelman toimintaan? Mitä kehitystarpeita näette?",
          "se": "Har utbildningsprogrammets undervisning och handledningsresurser varit tillräckliga? Hur har förhandlingarna mellan utbildningsprogrammet och fakulteten/avdelningen om lärarnas arbetsinsats gått? Vilka utvecklingsbehov anser ni att finns?",
          "en": "Have the teaching, guidance and supervision resources of the degree programme been sufficient? How successfully have the degree programme and the faculty/department negotiated on the contributions of teachers? Have changes been made to the teaching resources to such a degree that they have affected the programme operations? What areas should be developed?"
        },
        "required": true,
        "extrainfo": {
          "fi": "",
          "se": "",
          "en": ""
        }
      },
      {
        "id": "recruitment_influence",
        "index": 13,
        "type": "ENTITY",
        "shortLabel": {
          "fi": "Rekrytointi",
          "se": "Rekryteringen",
          "en": "Recruitment influence"
        },
        "label": {
          "fi": "OHJELMAN MAHDOLLISUUDET VAIKUTTAA UUDEN HENKILÖSTÖN REKRYTOINTIIN",
          "se": "UTBILDNINGSPROGRAMMETS MÖJLIGHETER ATT PÅVERKA REKRYTERINGEN AV NYA ANSTÄLLDA",
          "en": "OPPORTUNITIES TO INFLUENCE THE RECRUITMENT OF NEW STAFF"
        },
        "description": {
          "fi": "Miten koulutusohjelma on voinut vaikuttaa uuden henkilöstön rekrytointiin? Mitä kehitettävää tässä on?",
          "se": "På vilket sätt har utbildningsprogrammet kunnat påverka rekryteringen av ny personal? Vad behöver utvecklas i det?",
          "en": "How has the degree programme been able to influence the recruitment of new staff? What areas should be developed?"
        },
        "required": true,
        "extrainfo": {
          "fi": "",
          "se": "",
          "en": ""
        }
      },
      {
        "id": "resourcing",
        "index": 14,
        "type": "ENTITY",
        "shortLabel": {
          "fi": "Tila- ja laiteresurssit",
          "se": "Resurser",
          "en": "Equipment resources"
        },
        "label": {
          "fi": "TILA- JA LAITERESURSSIT SEKÄ OPPIMISYMPÄRISTÖJEN RESURSSIT",
          "se": "RESURSER FÖR LOKALER, UTRUSTNING OCH STUDIEMILJÖER",
          "en": "RESOURCES RELATED TO FACILITIES, EQUIPMENT AND LEARNING ENVIRONMENTS"
        },
        "description": {
          "fi": "Miten koulutusohjelman käytössä olevat tila- ja laiteresurssit sekä oppimisympäristöjen resurssit toimivat?",
          "se": "Hur fungerar utbildningsprogrammets resurser för lokaler, utrustning och studiemiljöer?",
          "en": "How would you describe the degree programme resources relating to facilities, equipment and learning environments?"
        },
        "required": true,
        "extrainfo": {
          "fi": "",
          "se": "",
          "en": ""
        }
      },
      {
        "id": "meta3",
        "type": "TITLE",
        "label": {
          "fi": "HENKILÖSTÖ- JA MUIDEN RESURSSIEN RIITTÄVYYS JA TOIMIVUUS",
          "se": "PERSONALRESURSERNAS OCH DE ANDRA RESURSERNAS TILLRÄCKLIGHET OCH ÄNDAMÅLSENLIGHET",
          "en": "SUFFICIENT AND APPROPRIATE HUMAN AND OTHER RESOURCES"
        }
      },
      {
        "id": "sufficient_resources_information_used",
        "index": "III",
        "type": "TEXTAREA",
        "label": {
          "fi": "Mitä muita tietoja ja tietolähteitä käytitte?",
          "se": "Vilka andra uppgifter och uppgiftskällor använde ni?",
          "en": "What other information and sources of information did you use?"
        },
        "required": false,
        "no_color": true,
        "extrainfo": {
          "fi": "",
          "se": "",
          "en": ""
        }
      },
      {
        "id": "sufficient_resources_information_needed",
        "index": "III",
        "type": "TEXTAREA",
        "label": {
          "fi": "Mitä tietoja kaipaatte näistä asioista?",
          "se": "Vilka uppgifter behöver ni om detta tema?",
          "en": "What information would you need?"
        },
        "required": false,
        "no_color": true,
        "extrainfo": {
          "fi": "",
          "se": "",
          "en": ""
        }
      }
    ]
  },
  {
    "title": {
      "fi": "USEAN TIEDEKUNNAN YHTEISEN OHJELMAN TOIMIVUUS",
      "se": "FAKULTETSÖVERSKRIDANDE PROGRAM",
      "en": "JOINT PROGRAMME WITH SEVERAL FACULTIES"
    },
    "parts": [
      {
        "id": "cooperation_success",
        "index": 15,
        "type": "ENTITY",
        "shortLabel": {
          "fi": "Yhteistyön sujuvuus",
          "se": "Samarbete",
          "en": "Cooperation"
        },
        "label": {
          "fi": "YHTEISTYÖN SUJUVUUS",
          "se": "SAMARBETE",
          "en": "COOPERATION"
        },
        "description": {
          "fi": "Miten yhteistyö on sujunut? Mitkä ovat tiedekuntarajat ylittävän toiminnan isoimmat ansiot ja haasteet?",
          "se": "Hur har samarbetet gått? Vilka är de främsta meriterna och utmaningarna i fråga om fakultetsöverskridande verksamhet?",
          "en": "How successfully have the partners cooperated? What are the major merits and challenges of cross-faculty operations?"
        },
        "required": false,
        "extrainfo": {
          "fi": "",
          "se": "",
          "en": ""
        }
      },
      {
        "id": "meta4",
        "type": "TITLE",
        "label": {
          "fi": "USEAN TIEDEKUNNAN YHTEISEN OHJELMAN TOIMIVUUS",
          "se": "FAKULTETSÖVERSKRIDANDE PROGRAM",
          "en": "JOINT PROGRAMME WITH SEVERAL FACULTIES"
        }
      },
      {
        "id": "joint_programme_information_used",
        "index": "IV",
        "type": "TEXTAREA",
        "label": {
          "fi": "Mitä tietoja ja tietolähteitä käytitte?",
          "se": "Vilka uppgifter och uppgiftskällor använde ni?",
          "en": "What information and sources of information did you use?"
        },
        "required": false,
        "no_color": true,
        "extrainfo": {
          "fi": "",
          "se": "",
          "en": ""
        }
      },
      {
        "id": "joint_programme_information_needed",
        "index": "IV",
        "type": "TEXTAREA",
        "label": {
          "fi": "Mitä tietoja kaipaatte?",
          "se": "Vilka uppgifter behöver ni om detta tema?",
          "en": "What information would you have needed?"
        },
        "required": false,
        "no_color": true,
        "extrainfo": {
          "fi": "",
          "se": "",
          "en": ""
        }
      }
    ]
  },
  {
    "title": {
      "fi": "ONNISTUMISIA JA KEHITTÄMISTOIMENPITEITÄ",
      "se": "FRAMGÅNGAR OCH UTVECKLINGSÅTGÄRDER",
      "en": "SUCCESSES AND DEVELOPMENT NEEDS"
    },
    "parts": [
      {
        "id": "successes_and_development_needs",
        "index": 16,
        "type": "ENTITY",
        "shortLabel": {
          "fi": "Onnistumiset",
          "se": "Framgånger",
          "en": "Successes"
        },
        "label": {
          "fi": "MISSÄ ASIOISSA KOULUTUSOHJELMA ON ONNISTUNUT ERITYISEN HYVIN?",
          "se": "I VILKA AVSEENDEN HAR UTBILDNINGSPROGRAMMET LYCKATS SÄRSKILT BRA?",
          "en": "IN WHAT AREAS HAS THE DEGREE PROGRAMME SUCCEEDED PARTICULARLY WELL?"
        },
        "description": {
          "fi": "Käykää läpi kirjaamanne pääkohdat ja pohtikaa, mitkä asiat ovat ohjelman toiminnassa onnistuneet erityisen hienosti. Kirjatkaa onnistumiset.",
          "se": "Gå igenom de centrala punkter som ni har antecknat och fundera över vad som har varit speciellt lyckat i utbildningsprogrammets verksamhet. Anteckna framgångarna.",
          "en": "Please review the main points you have recorded, trying to pinpoint areas where the programme has succeeded particularly well, and write them down."
        },
        "required": true,
        "no_color": true,
        "extrainfo": {
          "fi": "",
          "se": "",
          "en": ""
        }
      }
    ]
  },
  {
    "title": {
      "fi": "TOIMENPITEET",
      "se": "ÅTGÄRDER",
      "en": "LIST OF MEASURES"
    },
    "parts": [
      {
        "id": "measures",
        "index": 17,
        "type": "MEASURES",
        "shortLabel": {
          "fi": "Ohjelman toimenpiteet",
          "se": "Programmets åtgärder",
          "en": "Programme's measures"
        },
        "label": {
          "fi": "KOULUTUSOHJELMALLE",
          "se": "UTBILDNINGSPROGRAMMETS",
          "en": "FOR THE STUDYPROGRAMME"
        },
        "description": {
          "fi": "Koulutusohjelman toimenpiteet ja niiden vaatimat resurssit",
          "se": "Utbildningsprogrammets åtgärder och nödvändiga resurser",
          "en": "Studyprogramme's measures and the required resources"
        },
        "required": true,
        "no_color": true,
        "extrainfo": {
          "fi": "Kysymys on jaettu koulutusohjelman ja tiedekunnan osuuteen vuonna 2021",
          "se": "Denna fråga är uppdelad i två delar år 2021. En del för utbildningsprogrammet, och den andra för fakulteten.",
          "en": "This question has been divided into two separate sections in 2021. One section for the studyprogramme and one section for the faculty."
        }
      },
      {
        "id": "measures_faculty",
        "index": 18,
        "type": "MEASURES",
        "shortLabel": {
          "fi": "Tiedekunnan toimet",
          "se": "Fakultetens åtgärder",
          "en": "Faculty's measures"
        },
        "label": {
          "fi": "TIEDEKUNNALLE",
          "se": "FAKULTETENS",
          "en": "FOR THE FACULTY"
        },
        "description": {
          "fi": "Tiedekunnan toimenpiteet ja niiden vaatimat resurssit",
          "se": "Utbildningsprogrammets åtgärder och nödvändiga resurser",
          "en": "Faculty's measures and the required resources"
        },
        "required": true,
        "no_color": true,
        "extrainfo": {
          "fi": "Kysymys on lisätty vuonna 2021",
          "se": "Frågan har lagts till år 2021",
          "en": "Question has been added in 2021"
        }
      }
    ]
  },
  {
    "title": {
      "fi": "PALAUTE",
      "se": "FEEDBACK",
      "en": "FEEDBACK"
    },
    "parts": [
      {
        "id": "feedback",
        "index": 19,
        "type": "ENTITY",
        "shortLabel": {
          "fi": "Miten meni?",
          "se": "Hur gick det?",
          "en": "How did it go?"
        },
        "label": {
          "fi": "MITEN MENI?",
          "se": "HUR GICK DET?",
          "en": "HOW DID IT GO?"
        },
        "description": {
          "fi": "Miten koulutusohjelman johtoryhmän keskustelu tilannekuvasta sujui? Miten paljon keskustelu ja tilannekuvan kirjaaminen vei aikaa? Mikä oli parasta? Mitä pitää vielä kehittää?",
          "se": "Hur gick ledningsgruppens diskussion om lägesbeskrivningen? Hur lång tid tog diskussionen och anteckningarna om lägesbeskrivningen? Vad var det bästa? Vad behöver utvecklas ytterligare?",
          "en": "How did the steering group’s discussion on the current status of the degree programme go? How long did it take to complete the discussion and record the current status of the degree programme? What went well? What requires further development?"
        },
        "required": false,
        "extrainfo": {
          "fi": "",
          "se": "",
          "en": ""
        }
      }
    ]
  }
]
