[
  {
    "title": {
      "fi": "Kehittämiskohde 1: Opintopolkujen hallinta, nivelvaiheet ja horisontaaliset siirtymät",
      "se": "",
      "en": ""
    },
    "level": "kandimaisteri",
    "parts": [
      {
        "id": "1",
        "index": 1,

        "label": {
          "fi": "Koulutusohjelmat sisällyttävät opetussuunnitelmiin koulutusjärjestelmän, opintopolkujen ja opetustarjonnan hahmottamista tukevia mallilukujärjestyksiä",
          "se": "",
          "en": ""
        }
      },
      {
        "id": "2",
        "index": 2,

        "label": {
          "fi": "Yliopistossa kehitetään ja selkiytetään horisontaalisia siirtymiä ohjelmien sisällä ja välillä, jotta ne tukevat opiskelijan valintoja ja opiskelun sujuvuutta",
          "se": "",
          "en": ""
        }
      },
      {
        "id": "3",
        "index": 3,

        "label": {
          "fi": "Nivelvaiheen sujuvuus kandiohjelmasta maisteriohjelmaan siirryttäessä varmistetaan ohjauksellisin keinoin yhteistyössä",
          "se": "",
          "en": ""
        }
      },
      {
        "id": "4",
        "index": 4,

        "label": {
          "fi": "Yliopisto muodostaa strategisen näkemyksen siitä, mitä jatkuvan oppimisen tarjontaa yliopistossa järjestetään ja miksi",
          "se": "",
          "en": ""
        }
      }
    ]
  },
  {
    "title": {
      "fi": "Kehittämiskohde 2: Yliopiston läpivirtauksen määritelmä ja kriteerit sekä opintojen viivästymistä estävät keinot ",
      "se": "",
      "en": ""
    },
    "level": "kandimaisteri",
    "parts": [
      {
        "id": "5",
        "index": 5,

        "label": {
          "fi": "Yliopisto määrittelee läpivirtauksen ja sen kriteerit toiminnan laadun ja tuloksellisuuden lähtökohdista -ei pelkästään OKM-rahoitusmalliin perustuen",
          "se": "",
          "en": ""
        }
      },
      {
        "id": "6",
        "index": 6,

        "label": {
          "fi": "Koulutusohjelmat puuttuvat valmistumisaikojen venymiseen opintojen ohjauksella, opetuksen laadun jatkuvalla kehittämisellä ja opiskelijoiden oppimisen säätelyä ja hyvinvointia tukemalla",
          "se": "",
          "en": ""
        }
      },
      {
        "id": "7",
        "index": 7,

        "label": {
          "fi": "Koulutusohjelmat kehittävät opinnäytetöiden valmiiksi saattamiseen tehokkaat mekanismit hyödyntäen eri puolilla yliopistoa käytössä olevia hyviä käytäntöjä",
          "se": "",
          "en": ""
        }
      },
      {
        "id": "8",
        "index": 8,

        "label": {
          "fi": "Yliopistopedagogiikan keskus (HYPE) kohdistaa tutkimusta yliopiston koulutuksen kehittämiskohteisiin, jotta tutkimustulokset tukevat koulutusohjelmien kehittämistä",
          "se": "",
          "en": ""
        }
      },
      {
        "id": "9",
        "index": 9,

        "label": {
          "fi": "Opintojen etenemisen seurannassa koulutusohjelmat käyttävät kaikista opiskelijapalautejärjestelmistä saatavaa tietoa",
          "se": "",
          "en": ""
        }
      },
      {
        "id": "10",
        "index": 10,

        "label": {
          "fi": "Koulutusohjelma tarkastelee veto- ja pitovoimaansa kriittisesti, mikäli sillä ei ole riittävästi hakijoita ja/tai sen läpäisy on heikkoa. Tarkastelun perusteella koulutusohjelma ryhtyy toimenpiteisiin tilanteen parantamiseksi",
          "se": "",
          "en": ""
        }
      }
    ]
  },
  {
    "title": {
      "fi": "Kehittämiskohde 3: Koulutusohjelmien johtaminen yliopiston strategisena tehtävänä",
      "se": "",
      "en": ""
    },
    "level": "kandimaisteri",
    "parts": [
      {
        "id": "11",
        "index": 11,

        "label": {
          "fi": "Yliopisto vahvistaa koulutusohjelmajohtajien asemaa ottamalla heidät mukaan yliopiston johtamisen ja strategisen suunnittelun foorumeihin ja prosesseihin",
          "se": "",
          "en": ""
        }
      },
      {
        "id": "12",
        "index": 12,

        "label": {
          "fi": "Yliopisto vahvistaa koulutusohjelmien arvostusta siten, että koulutusohjelman johtamisesta tulee houkutteleva tehtävä",
          "se": "",
          "en": ""
        }
      },
      {
        "id": "13",
        "index": 13,

        "label": {
          "fi": "Yliopisto antaa koulutusohjelmille vallan ja vastuun ohjelman toiminnasta ja resurssien suunnittelusta muuttamalla yliopiston organisaatiorakenteita ja toimintaprosesseja",
          "se": "",
          "en": ""
        }
      },
      {
        "id": "14",
        "index": 14,

        "label": {
          "fi": "Yhteisten ohjelmien johtamisessa yliopisto ja tiedekunnat huolehtivat tehokkaasta tiedonkulusta ja sitoutumisesta opetusresurssin tarjoamiseen riittävän pitkäkestoisesti",
          "se": "",
          "en": ""
        }
      }
    ]
  },
  {
    "title": {
      "fi": "Kehittämiskohde 4: Opetusresurssien kattava haltuunotto koulutusohjelmien tarpeisiin",
      "se": "",
      "en": ""
    },
    "level": "kandimaisteri",
    "parts": [
      {
        "id": "15",
        "index": 15,

        "label": {
          "fi": "Yliopisto ratkaisee koulutusohjelmien toimintaedellytyksiä heikentävän rakenteellisen ongelman koulutusohjelmien toiminnan ja resurssien erillisyydestä",
          "se": "",
          "en": ""
        }
      },
      {
        "id": "16",
        "index": 16,

        "label": {
          "fi": "Yliopisto puuttuu johtamisen keinoin opetusresursseja koskeviin ongelmiin ja päättää ratkaista jo tunnistetut ongelmat",
          "se": "",
          "en": ""
        }
      },
      {
        "id": "17",
        "index": 17,

        "label": {
          "fi": "Yliopisto luo normit ja kehittää keinot opetuksen kuormittavuuden ja jakautumisen seurantaan ottaen huomioon erityyppisesti toteutetusta opetuksesta aiheutuva kuormitus",
          "se": "",
          "en": ""
        }
      },
      {
        "id": "18",
        "index": 18,

        "label": {
          "fi": "Yliopisto seuraa ja arvioi opetusresurssien tarvetta ja toteutumista säännöllisesti",
          "se": "",
          "en": ""
        }
      },
      {
        "id": "19",
        "index": 19,

        "label": {
          "fi": "Yliopisto vahvistaa opetuksen arvostusta, jotta opetustehtävät tulevat houkuttelevammiksi. Samalla sen pitää edistää opetustehtävien tasaisempaa jakautumista henkilökunnan kesken",
          "se": "",
          "en": ""
        }
      }
    ]
  },
  {
    "title": {
      "fi": "Kehittämiskohde 5: Koulutusohjelmien kielisyys ja kansainvälisten ohjelmien strateginen merkitys",
      "se": "",
      "en": ""
    },
    "level": "kandimaisteri",
    "parts": [
      {
        "id": "20",
        "index": 20,

        "label": {
          "fi": "Yliopisto selkiyttää ja tarkentaa kansainvälisten englanninkielisten koulutusohjelmien strategista merkitystä ",
          "se": "",
          "en": ""
        }
      },
      {
        "id": "21",
        "index": 21,

        "label": {
          "fi": "Yliopisto linjaa kansainvälisen henkilöstön kotimaisten kielten (suomi/ruotsi) oppimisen mahdollisuuksista ja velvollisuuksista ",
          "se": "",
          "en": ""
        }
      },
      {
        "id": "22",
        "index": 22,

        "label": {
          "fi": "Yliopisto tarkastaa monikielisten maisteriohjelmien käytäntöjen toimivuuden",
          "se": "",
          "en": ""
        }
      },
      {
        "id": "23",
        "index": 23,

        "label": {
          "fi": "Yliopisto edistää kansainvälisten opiskelijoiden työllistymistä Suomeen",
          "se": "",
          "en": ""
        }
      }
    ]
  },
  {
    "title": {
      "fi": "Kehittämiskohde 6: Koulutusohjelmien perustaminen ja lakkauttaminen yliopiston strategisina valintoina",
      "se": "",
      "en": ""
    },
    "level": "kandimaisteri",
    "parts": [
      {
        "id": "24",
        "index": 24,

        "label": {
          "fi": "Yliopisto kehittää strategisen suunnittelun käytännön, jolla uuden koulutusohjelman tarve tunnistetaan ottaen huomioon koulutusohjelman toiminnan rahoitus",
          "se": "",
          "en": ""
        }
      },
      {
        "id": "25",
        "index": 25,

        "label": {
          "fi": "Yliopisto ottaa käyttöön koulutusohjelmien yhdistämisen ja lakkauttamisen strategisina työkaluina ",
          "se": "",
          "en": ""
        }
      },
      {
        "id": "26",
        "index": 26,

        "label": {
          "fi": "Yliopisto päättää koulutusohjelmien perustamisen ja lakkauttamisen kriteeristöstä",
          "se": "",
          "en": ""
        }
      }
    ]
  },
  {
    "title": {
      "fi": "Kehittämiskohde 7: Koulutusohjelmaportfolion kehittäminen kokonaisuutena",
      "se": "",
      "en": ""
    },
    "level": "kandimaisteri",
    "parts": [
      {
        "id": "27",
        "index": 27,

        "label": {
          "fi": "Yliopisto seuraa jatkuvasti koulutusohjelmien veto- ja pitovoimaa ja tekee koulutusohjelmissa ja ohjelmaportfoliossa tarvittavia muutoksia, jos hakijoita ei ole riittävästi tai koulutusohjelma koetaan liian laaja-alaiseksi, hajanaiseksi tai muutoin toimivuudeltaan haasteelliseksi",
          "se": "",
          "en": ""
        }
      },
      {
        "id": "28",
        "index": 28,

        "label": {
          "fi": "Yliopisto tarkastaa säännöllisesti koulutusohjelmaportfolionsa ja arvioi muun muassa, onko koulutusohjelmia tai kandiohjelmien jälkeisiä maisteriohjelmaoptioita liikaa tai liian vähän, ovatko ohjelmien koulutusalat relevantteja ja onko ohjelmaportfoliossa sisällöllistä päällekkäisyyttä",
          "se": "",
          "en": ""
        }
      },
      {
        "id": "29",
        "index": 29,

        "label": {
          "fi": "Yliopisto kehittää maisteriohjelmien profiilien terävyyttä siten, että hakijat tunnistavat paremmin eri vaihtoehtoehdot",
          "se": "",
          "en": ""
        }
      },
      {
        "id": "30",
        "index": 30,

        "label": {
          "fi": "Yliopistossa on suositeltavaa valmistella ennakoivia skenaarioita ja keinovalikoima 8-10 vuoden päähän koulutusohjelmaportfolion kehittämiseksi ottaen huomioon valtiontalouden tilanne ja kansainvälinen toimintaympäristö",
          "se": "",
          "en": ""
        }
      }
    ]
  },
  {
    "title": {
      "fi": "Kehittämiskohde 1: Tohtorin tutkinnon suorittaminen tavoiteajassa",
      "se": "Utvecklingsobjekt 1: Avläggande av doktorsexamen inom målsatt tid",
      "en": "Development area 1: Completion of doctoral degrees within the target duration"
    },
    "level": "doctoral",
    "parts": [
      {
        "id": "T1",
        "index": 1,
        "label": {
          "fi": "Tohtoriohjelmat uudistavat opetussuunnitelmansa siten, että tohtorin tutkinnon voi suorittaa tavoiteajassa",
          "se": "Doktorandprogrammen ser över sina undervisningsplaner så att doktorsexamen kan avläggas inom utsatt tid",
          "en": "Doctoral programmes will redesign their curricula so that doctoral degrees can be completed within the target duration"
        }
      },
      {
        "id": "T2",
        "index": 2,
        "label": {
          "fi": "Kurssimuotoisen opetuksen määrää, sisältöä ja roolia tohtorin tutkinnossa pitää arvioida kriittisesti. Tarkastelua on hyvä tehdä suhteessa verrokkimaihin.",
          "se": "Den kursformade undervisningens omfattning, innehåll och roll i doktorsexamen bör granskas kritiskt. Det är motiverat att granska dem i jämförelse med referensländer.",
          "en": "The amount, content and role of course-based teaching in doctoral degrees must be examined critically and based on data from comparable countries."
        }
      },
      {
        "id": "T3",
        "index": 3,
        "label": {
          "fi": "Tohtoriohjelmien yhteistyöllä tuetaan tohtorikoulutuksen sujuvuutta väitöskirjatutkijoiden määrän lisääntyessä",
          "se": "Samarbete mellan doktorandprogram stöder en smidig doktorsutbildning när antalet doktorander ökar.",
          "en": "As the number of doctoral researchers increases, collaboration between doctoral programmes will support effective doctoral education."
        }
      },
      {
        "id": "T4",
        "index": 4,
        "label": {
          "fi": "Ohjauskäytänteissä on vaihtelua, mistä syystä ohjaajien koulutuksen voisi kohdentaa niihin tohtoriohjelmiin, joissa se on jo identifioitu ongelmaksi",
          "se": "Handledningspraxis varierar, och därför skulle handledarutbildningen kunna inriktas på de doktorandprogram där detta redan är ett identifierat problem.",
          "en": "With the variation in supervision practices, supervisor training could be targeted to the doctoral programmes that have already identified this as a problem."
        }
      },
      {
        "id": "T5",
        "index": 5,
        "label": {
          "fi": "Väitöskirjatutkijoiden volyymien kasvaessa yliopisto kehittää ohjauskäytäntöjä, ml. vertaistuki ja -ohjaus",
          "se": "I takt med att volymen doktorander ökar, utvecklar universitetet sin handledningspraxis inklusive kamratstöd och kamrathandledning.",
          "en": "As the volume of doctoral researchers grows, the University will develop supervision practices, including peer support and supervision."
        }
      }
    ]
  },
  {
    "title": {
      "fi": "Kehittämiskohde 2: Nivelvaihe maisterista tohtoriin",
      "se": "Utvecklingsobjekt 2: Övergångsfas från magister till doktorand",
      "en": "Development area 2: The transition stage from master’s to doctoral studies"
    },
    "level": "doctoral",
    "parts": [
      {
        "id": "T6",
        "index": 6,
        "label": {
          "fi": "Tohtorikoulutukseen rekrytointia tukevia käytäntöjä on suositeltavaa suunnitella alakohtaisesti yhteistyössä tohtori- ja maisteriohjelmien kesken",
          "se": "Det rekommenderas att praxis för rekrytering till doktorsutbildning utformas inom varje disciplin som ett samarbete mellan doktorand- och magisterprogrammen.",
          "en": "It is recommended that practices supporting recruitment to doctoral education be planned in each field through collaboration between doctoral and master’s programmes."
        }
      }
    ]
  },
  {
    "title": {
      "fi": "Kehittämiskohde 3: Uuden tutkijakoulurakenteen vakinaistaminen",
      "se": "Utvecklingsobjekt 3: Etablering av den nya forskarskolestrukturen",
      "en": "Development area 3: Consolidating the new doctoral school structure"
    },
    "level": "doctoral",
    "parts": [
      {
        "id": "T7",
        "index": 7,
        "label": {
          "fi": "Yliopisto jatkaa yhden tutkijakoulun toimintatapojen kehittämistä edelleen ottaen huomioon tohtorikoulutuksen monimuotoisuuden ja alojen erilaiset lähtökohdat",
          "se": "Universitetet fortsätter utveckla sin forskarskolas verksamhetssätt med beaktande av doktorsutbildningens heterogenitet och disciplinernas olika utgångspunkter.",
          "en": "The University will continue to develop practices and procedures for its single doctoral school, taking into account the versatility of doctoral education and field-specific starting points."
        }
      }
    ]
  },
  {
    "title": {
      "fi": "Kehittämiskohde 4: Tohtoriohjelmaportfolion kehittäminen kokonaisuutena",
      "se": "Utvecklingsobjekt 4: Utveckling av doktorsutbildningens programportfölj som helhet",
      "en": "Development area 4: Developing the doctoral programme portfolio comprehensively"
    },
    "level": "doctoral",
    "parts": [
      {
        "id": "T8",
        "index": 8,
        "label": {
          "fi": "Tohtoriohjelmien yhteistyötä tiivistämällä ja mahdollisesti ohjelmia yhdistämällä yliopisto voi tarjota väitöskirjatutkijoille monialaisempia tutkimusympäristöjä ja saada hyötyjä ohjelmajohdon ja koordinaation työhön",
          "se": "Genom att intensifiera samarbetet mellan doktorandprogrammen och eventuellt sammanslå program kan universitetet erbjuda doktorander mer mångdisciplinära forskningsmiljöer och få fördelar för programledning och koordinering.",
          "en": "By increasing collaboration between doctoral programmes and possibly merging programmes, the University can offer doctoral researchers more multidisciplinary research environments and support the leadership and coordination of programmes."
        }
      },
      {
        "id": "T9",
        "index": 9,
        "label": {
          "fi": "Tohtoriohjelmien yhteistyömahdollisuuksien tarkastelu sekä yliopiston sisällä että muiden yliopistojen kanssa on tarpeellista kasvavien väitöskirjatutkijamäärien koulutuksessa",
          "se": "På grund av den ökande doktorandvolymen är det nödvändigt att undersöka doktorandprogrammens möjligheter till samarbete, både inom och utanför universitetet.",
          "en": "As the number of doctoral researchers is set to increase, it is necessary to explore collaboration opportunities between the programmes within the University and with other universities."
        }
      }
    ]
  }
]
